In [93]:
import pandas as pd
import numpy as np

In [94]:
df = pd.read_csv("Bengaluru_House_Data_11.csv")

In [95]:
df.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [96]:
df.shape

(13320, 9)

In [97]:
df.isnull().sum()

area_type          0
availability       0
location           1
size              16
society         5502
total_sqft         0
bath              73
balcony          609
price              0
dtype: int64

In [98]:
df.drop(["area_type","availability","society","balcony"],axis = 1,inplace = True)

In [99]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [100]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13319 non-null  object
 1   size        13304 non-null  object
 2   total_sqft  13320 non-null  object
 3   bath        13247 non-null  float64
 4   price       13320 non-null  float64
dtypes: float64(2), object(3)
memory usage: 520.4+ KB

In [101]:
df.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [102]:
df.dropna(inplace = True)

In [103]:
df.isnull().sum()

location      0
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [104]:
df.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [105]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [106]:
l = []
for i in df["size"]:
    a = float(i.split(" ")[0])
    l.append(a)

In [107]:
df["BHK"] = 1
df.head()

                   location       size total_sqft  bath   price  BHK
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    1
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    1
2               Uttarahalli      3 BHK       1440   2.0   62.00    1
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    1
4                  Kothanur      2 BHK       1200   2.0   51.00    1

In [108]:
df.drop("size",axis = 1,inplace = True)
df.head()

                   location total_sqft  bath   price  BHK
0  Electronic City Phase II       1056   2.0   39.07    1
1          Chikka Tirupathi       2600   5.0  120.00    1
2               Uttarahalli       1440   2.0   62.00    1
3        Lingadheeranahalli       1521   3.0   95.00    1
4                  Kothanur       1200   2.0   51.00    1

In [109]:
df["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [110]:
def function(x):
    try:
        float(x)
        return float(x)
    except:
        l = x.split(" - ")
        if len(l) == 2:
            return (float(l[0]) + float(l[1]))/2
        else:
            return None
        return(float(l[0]) + float(l[1]))/2

In [111]:
df["total_sqft"] = df["total_sqft"].apply(function)
df.head()

                   location  total_sqft  bath   price  BHK
0  Electronic City Phase II      1056.0   2.0   39.07    1
1          Chikka Tirupathi      2600.0   5.0  120.00    1
2               Uttarahalli      1440.0   2.0   62.00    1
3        Lingadheeranahalli      1521.0   3.0   95.00    1
4                  Kothanur      1200.0   2.0   51.00    1

In [112]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13246 entries, 0 to 13319
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   location    13246 non-null  object
 1   total_sqft  13200 non-null  float64
 2   bath        13246 non-null  float64
 3   price       13246 non-null  float64
 4   BHK         13246 non-null  int64
dtypes: float64(3), int64(1), object(1)
memory usage: 620.9+ KB

In [113]:
df = df[~df.total_sqft.isnull()]
df = df[~df.location.isnull()]
df.isnull().sum()

location      0
total_sqft    0
bath          0
price         0
BHK           0
dtype: int64

In [114]:
df.head()

                   location  total_sqft  bath   price  BHK
0  Electronic City Phase II      1056.0   2.0   39.07    1
1          Chikka Tirupathi      2600.0   5.0  120.00    1
2               Uttarahalli      1440.0   2.0   62.00    1
3        Lingadheeranahalli      1521.0   3.0   95.00    1
4                  Kothanur      1200.0   2.0   51.00    1

In [115]:
df["price_per_sqft"] = (df["price"]*10000)/df["total_sqft"]
df.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    1      369.981061
1          Chikka Tirupathi      2600.0   5.0  120.00    1      461.538462
2               Uttarahalli      1440.0   2.0   62.00    1      430.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    1      624.589086
4                  Kothanur      1200.0   2.0   51.00    1      425.000000

In [116]:
df.location.unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [148]:
df["location"] = df["location"].apply(lambda x:str(x))

In [152]:
df["location"] = df["location"].apply(lambda x:x.strip())

In [153]:
df["location"] = df["location"].apply(lambda x:x.capitalize())

In [154]:
len(df.location.unique())

1

In [147]:
df.groupby("location")["location"].agg("count").sort_values(ascending = False)
df.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    1      369.981061
1          Chikka Tirupathi      2600.0   5.0  120.00    1      461.538462
2               Uttarahalli      1440.0   2.0   62.00    1      430.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    1      624.589086
4                  Kothanur      1200.0   2.0   51.00    1      425.000000

In [118]:
df.price_per_sqft.describe()

count    1.320000e+04
mean     7.920759e+02
std      1.067272e+04
min      2.678298e+01
25%      4.267701e+02
50%      5.438331e+02
75%      7.317073e+02
max      1.200000e+06
Name: price_per_sqft, dtype: float64

In [119]:
df1 = df[~((df.total_sqft/df.BHK) < 300)]
df.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    1      369.981061
1          Chikka Tirupathi      2600.0   5.0  120.00    1      461.538462
2               Uttarahalli      1440.0   2.0   62.00    1      430.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    1      624.589086
4                  Kothanur      1200.0   2.0   51.00    1      425.000000

In [120]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13189 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        13189 non-null  object
 1   total_sqft      13189 non-null  float64
 2   bath            13189 non-null  float64
 3   price           13189 non-null  float64
 4   BHK             13189 non-null  int64
 5   price_per_sqft  13189 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 721.3+ KB

In [121]:
def remove_pps_outlier(df):
    for keys,subdf in df.groupby("location"):
        M = np.median(subdf.price_per_sqft)
        m = np.mean(subdf.price_per_sqft)
        s = np.std(subdf.price_per_sqft)
        reduced_df = (subdf[(subdf.price_per_sqft>(m-s)) & (subdf.price_per_sqft<(m+s))])
        df1["price_per_sqft"] = df1["price_per_sqft"].apply(lambda x: x if x in reduced_df else M)
    return df1

In [122]:
df2 = remove_pps_outlier(df1)

C:\Users\admin\AppData\Local\Temp\ipykernel_7208\373794842.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1["price_per_sqft"] = df1["price_per_sqft"].apply(lambda x: x if x in reduced_df else M)

In [123]:
df2.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07    1      350.053476
1          Chikka Tirupathi      2600.0   5.0  120.00    1      350.053476
2               Uttarahalli      1440.0   2.0   62.00    1      350.053476
3        Lingadheeranahalli      1521.0   3.0   95.00    1      350.053476
4                  Kothanur      1200.0   2.0   51.00    1      350.053476

In [124]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13189 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        13189 non-null  object
 1   total_sqft      13189 non-null  float64
 2   bath            13189 non-null  float64
 3   price           13189 non-null  float64
 4   BHK             13189 non-null  int64
 5   price_per_sqft  13189 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 721.3+ KB

In [125]:
df2 = pd.get_dummies(data = df,columns = ["location"],drop_first = True)
df2.head()

,total_sqft,bath,price,BHK,price_per_sqft,location_ Banaswadi,location_ Basavangudi,location_ Bhoganhalli,location_ Devarabeesana Halli,location_ Devarachikkanahalli,...,location_rr nagar,location_sankeswari,location_sapthagiri Layout,location_sarjapura main road,location_singapura paradise,location_t.c palya,location_tc.palya,location_vinayakanagar,"location_white field,kadugodi",location_whitefiled
0,1056.0,2.0,39.07,1,369.981061,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2600.0,5.0,120.00,1,461.538462,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1440.0,2.0,62.00,1,430.555556,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1521.0,3.0,95.00,1,624.589086,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1200.0,2.0,51.00,1,425.000000,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [126]:
from sklearn.preprocessing import MinMaxScaler

In [127]:
scaler = MinMaxScaler()

In [128]:
l=["total_sqft","bath","price","BHK","price_per_sqft"]
for i in l:
      df2[i] = scaler.fit_transform(df2[[i]])

In [129]:
df2.head()

,total_sqft,bath,price,BHK,price_per_sqft,location_ Banaswadi,location_ Basavangudi,location_ Bhoganhalli,location_ Devarabeesana Halli,location_ Devarachikkanahalli,...,location_rr nagar,location_sankeswari,location_sapthagiri Layout,location_sarjapura main road,location_singapura paradise,location_t.c palya,location_tc.palya,location_vinayakanagar,"location_white field,kadugodi",location_whitefiled
0,0.020183,0.025641,0.008650,0.0,0.000286,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0.049722,0.102564,0.031180,0.0,0.000362,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0.027530,0.025641,0.015033,0.0,0.000336,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0.029079,0.051282,0.024220,0.0,0.000498,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0.022938,0.025641,0.011971,0.0,0.000332,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [130]:
X = df2.drop("price",axis = 1)
y = df2.price

In [131]:
from sklearn.model_selection import train_test_split

In [142]:
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.20, random_state=42)

In [143]:
from sklearn.linear_model import LinearRegression

In [144]:
model = LinearRegression()

In [145]:
model.fit(X_train,y_train)

LinearRegression()

In [146]:
model.score(X_test,y_test)

-4.220735212785211e+25